tap "ammarabouzor/tui-journal"
tap "arl/arl"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "koekeishiya/formulae"
tap "mikesmithgh/git-prompt-string"
tap "nikitabobko/tap"
tap "teamookla/speedtest"
brew "libssh2"
brew "aria2"
brew "atuin"
brew "bash"
brew "libgit2"
brew "bat"
brew "btop"
brew "certifi"
brew "cmake"
brew "cmake-docs"
brew "commitizen"
brew "coreutils"
brew "curl"
brew "dust"
brew "eza"
brew "fd"
brew "python@3.12"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fileicon"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "glow"
brew "go"
brew "imagemagick"
brew "img2pdf"
brew "jq"
brew "less"
brew "llm"
brew "lynx"
brew "mycli"
brew "protobuf"
brew "mysql"
brew "mysql@8.4"
brew "neovim"
brew "node"
brew "ocrmypdf"
brew "pam-reattach"
brew "pandoc"
brew "perl"
brew "pkgconf"
brew "poppler"
brew "rainfrog"
brew "rename"
brew "ripgrep"
brew "rust"
brew "sevenzip"
brew "shellcheck"
brew "starship"
brew "switchaudio-osx"
brew "tealdeer"
brew "texinfo"
brew "tmux"
brew "tokei"
brew "transmission-cli"
brew "tree"
brew "unar"
brew "uv"
brew "wget"
brew "yazi"
brew "zoxide"
brew "zsh"
brew "ammarabouzor/tui-journal/tui-journal"
brew "teamookla/speedtest/speedtest"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "alt-tab"
cask "arc"
cask "chatgpt"
cask "cleanshot"
cask "cursor"
cask "discord"
cask "docker"
cask "doll"
cask "dropbox"
cask "figma"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "hammerspoon"
cask "image2icon"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "mactex-no-gui"
cask "mimestream"
cask "notion"
cask "notion-calendar"
cask "openemu"
cask "postman"
cask "skim"
cask "slack"
cask "spotify"
cask "thinkorswim"
cask "tradingview"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "whatsapp"
cask "zoom"
