tap "1password/tap"
tap "arl/arl"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "koekeishiya/formulae"
tap "mikesmithgh/git-prompt-string"
tap "nikitabobko/tap"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
tap "teamookla/speedtest"
brew "atuin"
brew "bash"
brew "libssh2"
brew "libgit2@1.7"
brew "bat"
brew "boxes"
brew "btop"
brew "c2048"
brew "python@3.12"
brew "certifi"
brew "click"
brew "cmake"
brew "cmake-docs"
brew "cmatrix"
brew "commitizen"
brew "coreutils"
brew "diff-so-fancy"
brew "dust"
brew "libgit2"
brew "eza"
brew "fd"
brew "ffmpegthumbnailer"
brew "fileicon"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "glow"
brew "go"
brew "imagemagick"
brew "img2pdf"
brew "jq"
brew "less"
brew "lynx"
brew "mycli"
brew "protobuf"
brew "mysql", restart_service: true
brew "mysql@8.4"
brew "neovim"
brew "node"
brew "ocrmypdf"
brew "pam-reattach"
brew "pandoc"
brew "php"
brew "pipx"
brew "poppler"
brew "powerlevel10k"
brew "rename"
brew "ripgrep"
brew "rust"
brew "sevenzip"
brew "shellcheck"
brew "starship"
brew "switchaudio-osx"
brew "texinfo"
brew "tlrc"
brew "tmux"
brew "tokei"
brew "transmission-cli"
brew "tree"
brew "unar"
brew "wget"
brew "yazi"
brew "z.lua"
brew "zoxide"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "arl/arl/gitmux"
brew "teamookla/speedtest/speedtest"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "alt-tab"
cask "arc"
cask "chatgpt"
cask "cleanshot"
cask "discord"
cask "doll"
cask "dropbox"
cask "figma"
cask "firefox"
cask "font-comic-shanns-mono-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-symbols-only-nerd-font"
cask "google-chrome"
cask "image2icon"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "mactex"
cask "mimestream"
cask "notion-calendar"
cask "openemu"
cask "rectangle"
cask "skim"
cask "slack"
cask "spotify"
cask "tex-live-utility"
cask "thinkorswim"
cask "tradingview"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "fisheva.eva-theme"
vscode "github.vscode-github-actions"
vscode "james-yu.latex-workshop"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "tyriar.sort-lines"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
