tap "buo/cask-upgrade"
brew "atuin", restart_service: :changed
brew "bash"
brew "node"
brew "bash-language-server"
brew "libssh2"
brew "libgit2"
brew "bat"
brew "bob"
brew "btop"
brew "certifi"
brew "commitizen"
brew "coreutils"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fileicon"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "glow"
brew "jq"
brew "less"
brew "llm"
brew "lua-language-server"
brew "mycli"
brew "mysql", restart_service: :changed
brew "pam-reattach"
brew "pandoc"
brew "perl"
brew "pkgconf"
brew "protobuf"
brew "rainfrog"
brew "rename"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stylua"
brew "switchaudio-osx"
brew "tealdeer"
brew "tmux"
brew "tokei"
brew "tree"
brew "uv"
brew "wget"
brew "yazi"
brew "zoxide"
brew "zsh"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "alt-tab"
cask "anki"
cask "arc"
cask "chatgpt"
cask "chatgpt-atlas"
cask "cleanshot"
cask "codex"
cask "discord"
cask "dropbox"
cask "figma"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "hammerspoon"
cask "image2icon"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "mactex-no-gui"
cask "messenger"
cask "notion-calendar"
cask "postman"
cask "skim"
cask "slack"
cask "spotify"
cask "thinkorswim"
cask "visual-studio-code"
cask "vlc"
cask "wechat"
cask "wezterm"
cask "whatsapp"
vscode "catppuccin.catppuccin-vsc"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "openai.chatgpt"
