# Personal workstation GUI additions. Installed after the developer profile.

cask "alfred"
cask "alt-tab"
cask "anki"
cask "arc"
cask "chatgpt"
cask "claude"
cask "cleanshot"
cask "codex"
cask "discord"
cask "dropbox"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "image2icon"
cask "iterm2"
cask "keycastr"
cask "logi-options+"
cask "mactex-no-gui"
cask "notion-calendar"
cask "postman"
cask "skim"
cask "slack"
cask "spotify"
cask "thinkorswim"
cask "vlc"
cask "wechat"
cask "whatsapp"
