# Core profile: portable shell and terminal baseline.
# Add Brewfile.developer or Brewfile.personal through BOOTSTRAP_BREW_PROFILE.

brew "atuin"
brew "bash"
brew "bat"
brew "btop"
brew "dust"
brew "fastfetch"
brew "fd"
brew "gh"
brew "git"
brew "glow"
brew "jq"
brew "less"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "tealdeer"
brew "tokei"
brew "uv"
brew "wget"
brew "zoxide"
brew "zsh"

cask "font-jetbrains-mono-nerd-font"
cask "hammerspoon"
cask "karabiner-elements"
cask "wezterm"
