{
  "plugins": {
    "LuaSnip": {
    },
    "blink.cmp": {
    },
    "conform.nvim": {
    },
    "fzf-lua": {
    },
    "gitsigns.nvim": {
    },
    "indent-blankline.nvim": [],
    "noice.nvim": {
    },
    "nui.nvim": [],
    "nvim-autopairs": {
    },
    "nvim-dashboard": [],
    "nvim-highlight-colors": [],
    "nvim-notify": [],
    "nvim-sourdiesel": {
    },
    "nvim-spectre": [],
    "nvim-statusline": {
    },
    "nvim-surround": {
    },
    "nvim-terminal": [],
    "nvim-tree.lua": {
    },
    "nvim-treesitter": [],
    "nvim-web-devicons": {
    },
    "plenary.nvim": [],
    "vim-tmux-navigator": []
  }
}