tap "1password/tap"
tap "homebrew/bundle"
tap "nikitabobko/tap"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
tap "teamookla/speedtest"
brew "bash"
brew "libssh2"
brew "libgit2"
brew "bat"
brew "boxes"
brew "certifi"
brew "python@3.12"
brew "bpython"
brew "btop"
brew "click"
brew "cmake"
brew "cmake-docs"
brew "cmatrix"
brew "coreutils"
brew "diff-so-fancy"
brew "dust"
brew "eza"
brew "fileicon"
brew "fzf"
brew "gh"
brew "git"
brew "lazygit"
brew "less"
brew "lynx"
brew "mycli"
brew "mysql"
brew "neovim"
brew "node"
brew "pandoc"
brew "powerlevel10k"
brew "protobuf"
brew "python@3.11"
brew "ranger"
brew "rename"
brew "ripgrep"
brew "rust"
brew "shellcheck"
brew "stow"
brew "switchaudio-osx"
brew "texinfo"
brew "tmux"
brew "tokei"
brew "transmission-cli"
brew "tree"
brew "wget"
brew "z.lua"
brew "zoxide"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"
brew "teamookla/speedtest/speedtest"
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "alacritty"
cask "alfred"
cask "alt-tab"
cask "anaconda"
cask "arc"
cask "chatgpt"
cask "chatmate-for-whatsapp"
cask "cleanshot"
cask "dash"
cask "discord"
cask "dropbox"
cask "firefox"
cask "font-sauce-code-pro-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
cask "google-chrome"
cask "image2icon"
cask "iterm2"
cask "mactex"
cask "mimestream"
cask "notion"
cask "notion-calendar"
cask "skim"
cask "slack"
cask "spotify"
cask "tex-live-utility"
cask "thinkorswim"
cask "tradingview"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "fisheva.eva-theme"
vscode "github.vscode-github-actions"
vscode "james-yu.latex-workshop"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "tyriar.sort-lines"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
