tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "teamookla/speedtest"
brew "bash"
brew "libssh2"
brew "libgit2"
brew "bat"
brew "python-certifi"
brew "python@3.12"
brew "bpython"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "eza"
brew "fileicon"
brew "fzf"
brew "gh"
brew "git"
brew "node"
brew "gtop"
brew "mycli"
brew "mysql"
brew "neofetch"
brew "powerlevel10k"
brew "protobuf"
brew "python@3.11"
brew "rename"
brew "rust"
brew "texinfo"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh"
brew "teamookla/speedtest/speedtest"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "alt-tab"
cask "anaconda"
cask "arc"
cask "chatmate-for-whatsapp"
cask "cleanshot"
cask "dash"
cask "discord"
cask "dropbox"
cask "dropbox-dash"
cask "firefox"
cask "font-source-code-pro"
cask "google-chrome"
cask "google-drive"
cask "image2icon"
cask "iterm2"
cask "mactex"
cask "notion"
cask "notion-calendar"
cask "skim"
cask "slack"
cask "spotify"
cask "tex-live-utility"
cask "thinkorswim"
cask "tradingview"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
vscode "bierner.markdown-preview-github-styles"
vscode "davidanson.vscode-markdownlint"
vscode "deerawan.vscode-dash"
vscode "eamodio.gitlens"
vscode "fisheva.eva-theme"
vscode "formulahendry.code-runner"
vscode "james-yu.latex-workshop"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "svipas.notification-tester"
vscode "tyriar.sort-lines"
vscode "vscodevim.vim"
